-- MySQL Workbench Forward Engineering

SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0;
SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0;
SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='TRADITIONAL,ALLOW_INVALID_DATES';

-- -----------------------------------------------------
-- Schema Курсова
-- -----------------------------------------------------
DROP SCHEMA IF EXISTS `Курсова` ;

-- -----------------------------------------------------
-- Schema Курсова
-- -----------------------------------------------------
CREATE SCHEMA IF NOT EXISTS `Курсова` DEFAULT CHARACTER SET utf8 ;
USE `Курсова` ;

-- -----------------------------------------------------
-- Table `Курсова`.`Категорія активності`
-- -----------------------------------------------------
DROP TABLE IF EXISTS `Курсова`.`Категорія активності` ;

CREATE TABLE IF NOT EXISTS `Курсова`.`Категорія активності` (
  `Номер` INT NOT NULL AUTO_INCREMENT,
  `Категорія активності` VARCHAR(50) NOT NULL,
  PRIMARY KEY (`Номер`))
ENGINE = InnoDB;


-- -----------------------------------------------------
-- Table `Курсова`.`ТРВ`
-- -----------------------------------------------------
DROP TABLE IF EXISTS `Курсова`.`ТРВ` ;

CREATE TABLE IF NOT EXISTS `Курсова`.`ТРВ` (
  `Номер` INT NOT NULL AUTO_INCREMENT,
  `Категорія активності` INT NOT NULL,
  `Кількість` INT NOT NULL,
  `Загальна активність` INT NOT NULL,
  `Нуклід` INT NOT NULL,
  `Активність нукліда` INT NOT NULL,
  `Дата виготовлення` DATE NOT NULL,
  `Примітки` TINYTEXT NOT NULL,
  PRIMARY KEY (`Номер`),
  CONSTRAINT `ключ-трв-категорія`
    FOREIGN KEY (`Категорія активності`)
    REFERENCES `Курсова`.`Категорія активності` (`Номер`)
    ON DELETE CASCADE
    ON UPDATE CASCADE)
ENGINE = InnoDB;

CREATE INDEX `індекс-трв-категорія` ON `Курсова`.`ТРВ` (`Категорія активності` ASC);


-- -----------------------------------------------------
-- Table `Курсова`.`РРВ`
-- -----------------------------------------------------
DROP TABLE IF EXISTS `Курсова`.`РРВ` ;

CREATE TABLE IF NOT EXISTS `Курсова`.`РРВ` (
  `Номер` INT NOT NULL AUTO_INCREMENT,
  `Категорія активності` INT NOT NULL,
  `Кількість` INT NOT NULL,
  `Загальна активність` INT NOT NULL,
  `Нуклід` INT NOT NULL,
  `Активність нукліда` INT NOT NULL,
  `Дата виготовлення` DATE NOT NULL,
  `Примітки` TINYTEXT NOT NULL,
  PRIMARY KEY (`Номер`),
  CONSTRAINT `ключ-ррв-категорія`
    FOREIGN KEY (`Категорія активності`)
    REFERENCES `Курсова`.`Категорія активності` (`Номер`)
    ON DELETE CASCADE
    ON UPDATE CASCADE)
ENGINE = InnoDB;

CREATE INDEX `індекс-ррв-категорія` ON `Курсова`.`РРВ` (`Категорія активності` ASC);


-- -----------------------------------------------------
-- Table `Курсова`.`БРВ`
-- -----------------------------------------------------
DROP TABLE IF EXISTS `Курсова`.`БРВ` ;

CREATE TABLE IF NOT EXISTS `Курсова`.`БРВ` (
  `Номер` INT NOT NULL AUTO_INCREMENT,
  `Категорія активності` INT NOT NULL,
  `Кількість` INT NOT NULL,
  `Загальна активність` INT NOT NULL,
  `Нуклід` INT NOT NULL,
  `Активність нукліда` INT NOT NULL,
  `Дата виготовлення` DATE NOT NULL,
  `Примітки` TINYTEXT NOT NULL,
  PRIMARY KEY (`Номер`),
  CONSTRAINT `ключ-брв-категорія`
    FOREIGN KEY (`Категорія активності`)
    REFERENCES `Курсова`.`Категорія активності` (`Номер`)
    ON DELETE CASCADE
    ON UPDATE CASCADE)
ENGINE = InnoDB;

CREATE INDEX `індекс-брв-категорія` ON `Курсова`.`БРВ` (`Категорія активності` ASC);


-- -----------------------------------------------------
-- Table `Курсова`.`ДІВ`
-- -----------------------------------------------------
DROP TABLE IF EXISTS `Курсова`.`ДІВ` ;

CREATE TABLE IF NOT EXISTS `Курсова`.`ДІВ` (
  `Номер` INT NOT NULL AUTO_INCREMENT,
  `Категорія активності` INT NOT NULL,
  `Кількість` INT NOT NULL,
  `Загальна активність` INT NOT NULL,
  `Нуклід` INT NOT NULL,
  `Активність нукліда` INT NOT NULL,
  `Дата виготовлення` DATE NOT NULL,
  `Примітки` TINYTEXT NOT NULL,
  PRIMARY KEY (`Номер`),
  CONSTRAINT `дів-категорія`
    FOREIGN KEY (`Категорія активності`)
    REFERENCES `Курсова`.`Категорія активності` (`Номер`)
    ON DELETE CASCADE
    ON UPDATE CASCADE)
ENGINE = InnoDB;

CREATE INDEX `індекс-дів-категорія` ON `Курсова`.`ДІВ` (`Категорія активності` ASC);


-- -----------------------------------------------------
-- Table `Курсова`.`Радіонуклід`
-- -----------------------------------------------------
DROP TABLE IF EXISTS `Курсова`.`Радіонуклід` ;

CREATE TABLE IF NOT EXISTS `Курсова`.`Радіонуклід` (
  `Номер` INT NOT NULL,
  `Назва` TINYTEXT NOT NULL,
  `Скорочено` VARCHAR(10) NOT NULL,
  `Номер порядку` INT NOT NULL,
  `Активність нукліда` INT NOT NULL,
  PRIMARY KEY (`Номер`))
ENGINE = InnoDB;


-- -----------------------------------------------------
-- Table `Курсова`.`Категорія відходу`
-- -----------------------------------------------------
DROP TABLE IF EXISTS `Курсова`.`Категорія відходу` ;

CREATE TABLE IF NOT EXISTS `Курсова`.`Категорія відходу` (
  `Номер` INT NOT NULL AUTO_INCREMENT,
  `Категорія відходу` VARCHAR(10) NOT NULL,
  PRIMARY KEY (`Номер`))
ENGINE = InnoDB;


-- -----------------------------------------------------
-- Table `Курсова`.`Завод`
-- -----------------------------------------------------
DROP TABLE IF EXISTS `Курсова`.`Завод` ;

CREATE TABLE IF NOT EXISTS `Курсова`.`Завод` (
  `Номер` INT NOT NULL AUTO_INCREMENT,
  `Категорія відходу` INT NOT NULL,
  `Нуклід` INT NOT NULL,
  `Кількість` INT NOT NULL,
  `Дата виготовлення` DATE NOT NULL,
  `Примітки` TINYTEXT NOT NULL,
  PRIMARY KEY (`Номер`),
  CONSTRAINT `ключ-Завод-Нуклід`
    FOREIGN KEY (`Нуклід`)
    REFERENCES `Курсова`.`Радіонуклід` (`Номер`)
    ON DELETE CASCADE
    ON UPDATE CASCADE,
  CONSTRAINT `ключ-Завод-Категорія відходу`
    FOREIGN KEY (`Категорія відходу`)
    REFERENCES `Курсова`.`Категорія відходу` (`Номер`)
    ON DELETE CASCADE
    ON UPDATE CASCADE)
ENGINE = InnoDB;

CREATE INDEX `індекс-Завод-Категорія-відходу` ON `Курсова`.`Завод` (`Категорія відходу` ASC);

CREATE INDEX `індекс-Завод-Нуклід` ON `Курсова`.`Завод` (`Нуклід` ASC);

USE `Курсова`;

DELIMITER $$

USE `Курсова`$$
DROP TRIGGER IF EXISTS `Курсова`.`ЗАВОТ_ПІСЛЯ_ВСТАВКИ` $$
USE `Курсова`$$
CREATE DEFINER = CURRENT_USER TRIGGER `Курсова`.`ЗАВОТ_ПІСЛЯ_ВСТАВКИ` AFTER INSERT ON `Завод` FOR EACH ROW

begin



SET @Номер = NEW.`Номер`;

SET @Кількість = NEW.`Кількість`;

SET @Активність_нукліда = 1;

SELECT `Активність нукліда` INTO @Активність_нукліда FROM `Радіонуклід` WHERE (`Номер`=NEW.`Нуклід`);

SET @Загальна_активність = @Кількість * @Активність_нукліда;

set @Нуклід = NEW.`Нуклід`;

set @Категорія_активності = '3';

IF(@Загальна_активність < 1000000)then set @Категорія_активності = '2'; END IF;

IF(@Загальна_активність < 10000) then set @Категорія_активності = '1'; END IF;

set @Примітки = NEW.`Примітки`;

set @Дата_виготовлення = NEW.`Дата виготовлення`;



IF(NEW.`Категорія відходу` = 1)

then 

INSERT INTO `Курсова`.`ТРВ` (`Категорія активності`, `Кількість`, `Загальна активність`, `Нуклід`, `Активність нукліда`, `Дата виготовлення`, `Примітки`) VALUES (@Категорія_активності, @Кількість, @Загальна_активність, @Нуклід, @Активність_нукліда, @Дата_виготовлення, @Примітки);

END IF;



IF(NEW.`Категорія відходу` = 2)

then 

INSERT INTO `Курсова`.`БРВ` (`Категорія активності`, `Кількість`, `Загальна активність`, `Нуклід`, `Активність нукліда`, `Дата виготовлення`, `Примітки`) VALUES (@Категорія_активності, @Кількість, @Загальна_активність, @Нуклід, @Активність_нукліда, @Дата_виготовлення, @Примітки);

END IF;



IF(NEW.`Категорія відходу` = 3)

then 

INSERT INTO `Курсова`.`РРВ` (`Категорія активності`, `Кількість`, `Загальна активність`, `Нуклід`, `Активність нукліда`, `Дата виготовлення`, `Примітки`) VALUES (@Категорія_активності, @Кількість, @Загальна_активність, @Нуклід, @Активність_нукліда, @Дата_виготовлення, @Примітки);

END IF;



IF(NEW.`Категорія відходу` = 4)

then 

INSERT INTO `Курсова`.`ДІВ` (`Категорія активності`, `Кількість`, `Загальна активність`, `Нуклід`, `Активність нукліда`, `Дата виготовлення`, `Примітки`) VALUES (@Категорія_активності, @Кількість, @Загальна_активність, @Нуклід, @Активність_нукліда, @Дата_виготовлення, @Примітки);

END IF;



end;$$


DELIMITER ;

SET SQL_MODE=@OLD_SQL_MODE;
SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS;
SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS;



-- -----------------------------------------------------
-- Data for table `Курсова`.`КАТЕГОРІЯ`
-- -----------------------------------------------------
START TRANSACTION;
USE `Курсова`;
INSERT INTO `Курсова`.`Категорія активності` (`Номер`, `Категорія активності`) VALUES (1, 'Слабоактивний');
INSERT INTO `Курсова`.`Категорія активності` (`Номер`, `Категорія активності`) VALUES (2, 'Середньоактивний');
INSERT INTO `Курсова`.`Категорія активності` (`Номер`, `Категорія активності`) VALUES (3, 'Сильноактивний');

COMMIT;


-- -----------------------------------------------------
-- Data for table `Курсова`.`Категорія відходу`
-- -----------------------------------------------------
START TRANSACTION;
USE `Курсова`;
INSERT INTO `Курсова`.`Категорія відходу` (`Номер`, `Категорія відходу`) VALUES (1, 'ТРВ');
INSERT INTO `Курсова`.`Категорія відходу` (`Номер`, `Категорія відходу`) VALUES (2, 'РРВ');
INSERT INTO `Курсова`.`Категорія відходу` (`Номер`, `Категорія відходу`) VALUES (3, 'БРВ');
INSERT INTO `Курсова`.`Категорія відходу` (`Номер`, `Категорія відходу`) VALUES (4, 'ДІВ');

COMMIT;


-- -----------------------------------------------------
-- Data for table `Курсова`.`Радіонуклід`
-- -----------------------------------------------------
START TRANSACTION;
USE `Курсова`;
INSERT INTO `Курсова`.`Радіонуклід` (`Номер`, `Назва`, `Скорочено`, `Номер порядку`, `Активність нукліда`) VALUES ('1', 'Криптон', 'Kr', '85', '33');
INSERT INTO `Курсова`.`Радіонуклід` (`Номер`, `Назва`, `Скорочено`, `Номер порядку`, `Активність нукліда`) VALUES ('2', 'Ксенон', 'Xe', '133', '6500');
INSERT INTO `Курсова`.`Радіонуклід` (`Номер`, `Назва`, `Скорочено`, `Номер порядку`, `Активність нукліда`) VALUES ('3', 'Телур', 'Te', '132', '1150');
INSERT INTO `Курсова`.`Радіонуклід` (`Номер`, `Назва`, `Скорочено`, `Номер порядку`, `Активність нукліда`) VALUES ('4', 'Йод', 'I', '131', '1760');
INSERT INTO `Курсова`.`Радіонуклід` (`Номер`, `Назва`, `Скорочено`, `Номер порядку`, `Активність нукліда`) VALUES ('5', 'Цезій', 'Cs', '136', '36');
INSERT INTO `Курсова`.`Радіонуклід` (`Номер`, `Назва`, `Скорочено`, `Номер порядку`, `Активність нукліда`) VALUES ('6', 'Стронцій', 'Sr', '89', '115');
INSERT INTO `Курсова`.`Радіонуклід` (`Номер`, `Назва`, `Скорочено`, `Номер порядку`, `Активність нукліда`) VALUES ('7', 'Рутеній', 'Ru', '103', '168');
INSERT INTO `Курсова`.`Радіонуклід` (`Номер`, `Назва`, `Скорочено`, `Номер порядку`, `Активність нукліда`) VALUES ('8', 'Барій', 'Ba', '140', '240');
INSERT INTO `Курсова`.`Радіонуклід` (`Номер`, `Назва`, `Скорочено`, `Номер порядку`, `Активність нукліда`) VALUES ('9', 'Цирконій', 'Zr', '95', '84');
INSERT INTO `Курсова`.`Радіонуклід` (`Номер`, `Назва`, `Скорочено`, `Номер порядку`, `Активність нукліда`) VALUES ('10', 'Молібден', 'Mo', '99', '72');
INSERT INTO `Курсова`.`Радіонуклід` (`Номер`, `Назва`, `Скорочено`, `Номер порядку`, `Активність нукліда`) VALUES ('11', 'Церій', 'Ce', '141', '84');
INSERT INTO `Курсова`.`Радіонуклід` (`Номер`, `Назва`, `Скорочено`, `Номер порядку`, `Активність нукліда`) VALUES ('12', 'Нептуній', 'Np', '239', '400');
INSERT INTO `Курсова`.`Радіонуклід` (`Номер`, `Назва`, `Скорочено`, `Номер порядку`, `Активність нукліда`) VALUES ('13', 'Плутоній', 'Pu', '241', '3');
INSERT INTO `Курсова`.`Радіонуклід` (`Номер`, `Назва`, `Скорочено`, `Номер порядку`, `Активність нукліда`) VALUES ('14', 'Кюрій', 'Cm', '242', '1');

COMMIT;
