CREATE DEFINER = CURRENT_USER TRIGGER `курсова`.`ЗАВОТ_ПІСЛЯ_ВСТАВКИ` AFTER INSERT ON `ЗАВОД` FOR EACH ROW

begin



SET @НОМЕР = NEW.`НОМЕР`;

SET @КІЛЬКІСТЬ = NEW.`КІЛЬКІСТЬ`;

SET @АКТИВНІСТЬ_НУКЛІДА = 1;

SELECT `АКТИВНІСТЬ_НУКЛІДА` INTO @АКТИВНІСТЬ_НУКЛІДА FROM `РАДІОНУКЛІД` WHERE (`НОМЕР`=NEW.`НУКЛІД`);

SET @ЗАГАЛЬНА_АКТИВНІСТЬ = @КІЛЬКІСТЬ * @АКТИВНІСТЬ_НУКЛІДА;

set @НУКЛІД = NEW.`НУКЛІД`;

set @КАТЕГОРІЯ_АКТИВНОСТІ = '3';

IF(@ЗАГАЛЬНА_АКТИВНІСТЬ < 1000000)then set @КАТЕГОРІЯ_АКТИВНОСТІ = '2'; END IF;

IF(@ЗАГАЛЬНА_АКТИВНІСТЬ < 10000) then set @КАТЕГОРІЯ_АКТИВНОСТІ = '1'; END IF;

set @ПРИМІТКИ = NEW.`ПРИМІТКИ`;

set @ДАТА_ВИГОТОВЛЕННЯ = NEW.`ДАТА_ВИГОТОВЛЕННЯ`;



IF(NEW.КАТЕГОРІЯ_ВІДХОДУ = 1)

then 

INSERT INTO `КУРСОВА`.`ТРВ` (`НОМЕР`, `КАТЕГОРІЯ_АКТИВНОСТІ`, `КІЛЬКІСТЬ`, `ЗАГАЛЬНА_АКТИВНІСТЬ`, `НУКЛІД`, `АКТИВНІСТЬ_НУКЛІДА`, `ДАТА_ВИГОТОВЛЕННЯ`, `ПРИМІТКИ`) VALUES (@НОМЕР, @КАТЕГОРІЯ_АКТИВНОСТІ, @КІЛЬКІСТЬ, @ЗАГАЛЬНА_АКТИВНІСТЬ, @НУКЛІД, @АКТИВНІСТЬ_НУКЛІДА, @ДАТА_ВИГОТОВЛЕННЯ, @ПРИМІТКИ);

END IF;



IF(NEW.КАТЕГОРІЯ_ВІДХОДУ = 2)

then 

INSERT INTO `КУРСОВА`.`РРВ` (`НОМЕР`, `КАТЕГОРІЯ_АКТИВНОСТІ`, `КІЛЬКІСТЬ`, `ЗАГАЛЬНА_АКТИВНІСТЬ`, `НУКЛІД`, `АКТИВНІСТЬ_НУКЛІДА`, `ДАТА_ВИГОТОВЛЕННЯ`, `ПРИМІТКИ`) VALUES (@НОМЕР, @КАТЕГОРІЯ_АКТИВНОСТІ, @КІЛЬКІСТЬ, @ЗАГАЛЬНА_АКТИВНІСТЬ, @НУКЛІД, @АКТИВНІСТЬ_НУКЛІДА, @ДАТА_ВИГОТОВЛЕННЯ, @ПРИМІТКИ);

END IF;



IF(NEW.КАТЕГОРІЯ_ВІДХОДУ = 3)

then 

INSERT INTO `КУРСОВА`.`БРВ` (`НОМЕР`, `КАТЕГОРІЯ_АКТИВНОСТІ`, `КІЛЬКІСТЬ`, `ЗАГАЛЬНА_АКТИВНІСТЬ`, `НУКЛІД`, `АКТИВНІСТЬ_НУКЛІДА`, `ДАТА_ВИГОТОВЛЕННЯ`, `ПРИМІТКИ`) VALUES (@НОМЕР, @КАТЕГОРІЯ_АКТИВНОСТІ, @КІЛЬКІСТЬ, @ЗАГАЛЬНА_АКТИВНІСТЬ, @НУКЛІД, @АКТИВНІСТЬ_НУКЛІДА, @ДАТА_ВИГОТОВЛЕННЯ, @ПРИМІТКИ);

END IF;



IF(NEW.КАТЕГОРІЯ_ВІДХОДУ = 4)

then 

INSERT INTO `КУРСОВА`.`ДІВ` (`НОМЕР`, `КАТЕГОРІЯ_АКТИВНОСТІ`, `КІЛЬКІСТЬ`, `ЗАГАЛЬНА_АКТИВНІСТЬ`, `НУКЛІД`, `АКТИВНІСТЬ_НУКЛІДА`, `ДАТА_ВИГОТОВЛЕННЯ`, `ПРИМІТКИ`) VALUES (@НОМЕР, @КАТЕГОРІЯ_АКТИВНОСТІ, @КІЛЬКІСТЬ, @ЗАГАЛЬНА_АКТИВНІСТЬ, @НУКЛІД, @АКТИВНІСТЬ_НУКЛІДА, @ДАТА_ВИГОТОВЛЕННЯ, @ПРИМІТКИ);

END IF;



end;